tutorials/interIsoFoam_gepperthPrefilmer/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1e-3;

vertices
(
    ( 0  0  0  )  // 0
    ( 0  1.5  0  )  // 1
    ( 1  1.5  0  )  // 2
    ( 1  1.7  0  )  // 3
    ( 0  1.7  0 ) // 4
    ( 0  1.8  0 ) // 5
    ( 0  3.3  0 ) // 6
    ( 1  3.3  0 ) // 7
    ( 6  3.3  0 ) // 8
    ( 6  1.8  0 ) // 9
    ( 6  1.7  0 ) // 10
    ( 6  1.5  0 ) // 11
    ( 6  0  0  )  // 12
    ( 1  0  0  )  // 13
    ( 0  0  0.1  )  // 14
    ( 0  1.5  0.1  )  // 15
    ( 1  1.5  0.1  )  // 16
    ( 1  1.7  0.1  )  // 17
    ( 0  1.7  0.1 ) // 18
    ( 0  1.8  0.1 ) // 19
    ( 0  3.3  0.1 ) // 20
    ( 1  3.3  0.1 ) // 21
    ( 6  3.3  0.1 ) // 22
    ( 6  1.8  0.1 ) // 23
    ( 6  1.7  0.1 ) // 24
    ( 6  1.5  0.1 ) // 25
    ( 1  0  0.1  )  // 26
    ( 6  0  0.1  )  // 27
    ( 1  1.8  0 ) // 28
    ( 1  1.8  0.1 ) // 29

);

blocks
(
    hex (14 15 16 26 0 1 2 13) (75 50 1) simpleGrading (1 1 1) // Block 1
    hex (17 29 23 24 3 28 9 10) (5 250 1) simpleGrading (1 1 1) // Block 5
    hex (16 17 24 25 2 3 10 11) (10 250 1) simpleGrading (1 1 1)  // Block 6
    hex (29 21 22 23 28 7 8 9) (75 250 1) simpleGrading (1 1 1) // Block 4
    hex (17 18 19 29 3 4 5 28) (50 5 1) simpleGrading (1 1 1) // Block 2
    hex (29 19 20 21 28 5 6 7) (50 75 1) simpleGrading (1 1 1) // Block 3
    hex (16 25 27 26 2 11 12 13) (250 75 1) simpleGrading (1 1 1) // Block 7
);

edges
(
);

boundary
(
    front
    {
        type patch;
        faces
        (
            (0 1 15 14)
            (5 6 20 19)
        );
    }
    prefilmer
    {
        type patch;
        faces
        (
            (2 1 16 15)
            (2 3 17 16)
            (3 4 18 17)
        );
    }
    prefilmerInlet
    {
        type patch;
        faces
        (
            (4 5 19 18)
        );
    }

    back
    {
        type patch;
        faces
        (
            (8 9 23 22)
            (9 10 24 23)
            (10 11 25 24)
            (11 12 27 25)
        );
    }
    left
    {
        type patch;
        faces
        (
            (6 7 21 20)
            (7 8 22 21)
            
        );
    }
    right
    {
        type patch;
        faces
        (
            (13 0 14 26)
            (12 13 26 27)
        );
    }
    topAndBottom
    {
        type empty;
        faces
        (
            (0 13 2 1) // Clockwise, Block 1
            (3 4 28 5) // Block 2
            (28 5 7 6) // Block 3
            (28 7 8 9) // Block 4
            (3 28 9 10) // Block 5
            (2 3 11 10) // Block 6
            (2 11 13 12) // Block 7

            (14 26 16 15) // Clockwise, Block 1
            (17 18 29 19) // Block 2
            (29 19 21 20) // Block 3
            (29 21 22 23) // Block 4
            (17 29 23 24) // Block 5
            (16 17 25 24) // Block 6
            (16 25 26 27) // Block 7
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
