tutorials/interIsoFoam_gepperthPrefilmer/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

// regions
// (
//     cylinderToCell
//     {
//         p1       (0.5 0.5 -1);
//         p2       (0.5 0.5  1);
//         radius    0.25;
//         fieldValues
//         (
//             volScalarFieldValue alpha.water 0
//         );
//     }
// );


// ************************************************************************* //
